Jmeter/report-20260907-035315/statistics.json
{
  "Status Request" : {
    "transaction" : "Status Request",
    "sampleCount" : 93231,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 72.60027244156981,
    "medianResTime" : 55.0,
    "minResTime" : 50.0,
    "maxResTime" : 1201.0,
    "pct1ResTime" : 159.0,
    "pct2ResTime" : 162.0,
    "pct3ResTime" : 169.0,
    "throughput" : 71.84104674279902,
    "receivedKBytesPerSec" : 386.9371758487351,
    "sentKBytesPerSec" : 0.0
  },
  "Environment State" : {
    "transaction" : "Environment State",
    "sampleCount" : 800,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 159.4824999999998,
    "medianResTime" : 159.0,
    "minResTime" : 152.0,
    "maxResTime" : 214.0,
    "pct1ResTime" : 162.0,
    "pct2ResTime" : 164.0,
    "pct3ResTime" : 199.98000000000002,
    "throughput" : 6.74769524034447,
    "receivedKBytesPerSec" : 3.255235789775555,
    "sentKBytesPerSec" : 1.4035733263607149
  },
  "Enqueue Simple" : {
    "transaction" : "Enqueue Simple",
    "sampleCount" : 775,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 61.277419354838685,
    "medianResTime" : 55.0,
    "minResTime" : 51.0,
    "maxResTime" : 725.0,
    "pct1ResTime" : 58.0,
    "pct2ResTime" : 144.1999999999996,
    "pct3ResTime" : 161.72000000000003,
    "throughput" : 6.680804110203096,
    "receivedKBytesPerSec" : 7.5117207030576525,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 97206,
    "errorCount" : 800,
    "errorPct" : 0.8229945,
    "meanResTime" : 72.70992531325038,
    "medianResTime" : 55.0,
    "minResTime" : 0.0,
    "maxResTime" : 1330.0,
    "pct1ResTime" : 159.0,
    "pct2ResTime" : 162.0,
    "pct3ResTime" : 169.0,
    "throughput" : 74.59350201781385,
    "receivedKBytesPerSec" : 410.5778433971751,
    "sentKBytesPerSec" : 0.42325554447976926
  },
  "Safetynet" : {
    "transaction" : "Safetynet",
    "sampleCount" : 25,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.6,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 30.26634382566586,
    "receivedKBytesPerSec" : 459.388714437046,
    "sentKBytesPerSec" : 0.0
  },
  "Target Site - Protected Page" : {
    "transaction" : "Target Site - Protected Page",
    "sampleCount" : 800,
    "errorCount" : 800,
    "errorPct" : 100.0,
    "meanResTime" : 33.07999999999997,
    "medianResTime" : 23.0,
    "minResTime" : 18.0,
    "maxResTime" : 1204.0,
    "pct1ResTime" : 34.0,
    "pct2ResTime" : 47.0,
    "pct3ResTime" : 478.0,
    "throughput" : 6.729022273063724,
    "receivedKBytesPerSec" : 4.3799757965480115,
    "sentKBytesPerSec" : 3.239656231074625
  },
  "Initial request" : {
    "transaction" : "Initial request",
    "sampleCount" : 800,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 121.88750000000003,
    "medianResTime" : 104.0,
    "minResTime" : 52.0,
    "maxResTime" : 1330.0,
    "pct1ResTime" : 207.0,
    "pct2ResTime" : 212.94999999999993,
    "pct3ResTime" : 1161.9,
    "throughput" : 6.7637261367287245,
    "receivedKBytesPerSec" : 238.49462277166927,
    "sentKBytesPerSec" : 0.0
  },
  "Enqueued" : {
    "transaction" : "Enqueued",
    "sampleCount" : 775,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.2322580645161289,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 35.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 6.683742550861124,
    "receivedKBytesPerSec" : 21.833123859990685,
    "sentKBytesPerSec" : 0.0
  }
}